# GetMaterialIdForCurrentExportState Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFC..::..GetMaterialIdForCurrentExportState Method
ExporterIFC Class See Also
---
This gets the material id that is associated with the element in the current export state.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId GetMaterialIdForCurrentExportState()
```

Visual Basic
---
```text
Public Function GetMaterialIdForCurrentExportState As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetMaterialIdForCurrentExportState()
```

# ### Return Value
The material id.
# Remarks
Even though there could be several materials associated with the element (set during PushExportState()), unless the element has support for IfcMaterialLayerSet, IFC output will include only this one.
# See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace